alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1100.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU_INTERRUPT</name>
			<description>System Control Unit</description>
			<baseAddress>0x40010038</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x010</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SCU_0</name>
				<description>System Control</description>
				<value>0</value>
			</interrupt>
			<interrupt>
				<name>SCU_1</name>
				<description>System Control</description>
				<value>1</value>
			</interrupt>
			<interrupt>
				<name>SCU_2</name>
				<description>System Control</description>
				<value>2</value>
			</interrupt>
			<registers>
				<register>
					<name>SRRAW</name>
					<description>SCU Raw Service Request Status</description>
					<addressOffset>0x0000</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRWARN</name>
							<description>WDT pre-warning Event Status Before Masking</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PI</name>
							<description>RTC Raw Periodic Event Status Before Masking</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AI</name>
							<description>RTC Raw Alarm Event Status Before Masking</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VDDPI</name>
							<description>VDDP pre-warning Event Status Before Masking</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VDROPI</name>
							<description>VDROP Event Status Before Masking</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LOCI</name>
							<description>Loss of Clock Event Status Before Masking</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PESRAMI</name>
							<description>16kbytes SRAM Parity Error Event Status Before Masking</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PEU0I</name>
							<description>USIC0 SRAM Parity Error Event Status Before Masking</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLECC2I</name>
							<description>Flash Double Bit ECC Event Status Before Masking</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLCMPLTI</name>
							<description>Flash Operation Complete Event Status Before Masking</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VCLIPI</name>
							<description>VCLIP Event Status Before Masking</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SBYCLKFI</name>
							<description>Standby Clock Failure Event Status Before Masking</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RTC_CTR</name>
							<description>RTC CTR Mirror Register Update Status Before Masking</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RTC_ATIM0</name>
							<description>RTC ATIM0 Mirror Register Update Status Before Masking</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RTC_ATIM1</name>
							<description>RTC ATIM1 Mirror Register Update Status Before Masking</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RTC_TIM0</name>
							<description>RTC TIM0 Mirror Register Update Before Masking</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RTC_TIM1</name>
							<description>RTC TIM1 Mirror Register Update Status Before Masking</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSE_DONE</name>
							<description>TSE Measurement Done Event Status Before Masking</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSE_HIGH</name>
							<description>TSE Compare High Temperature Event Status Before Masking</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSE_LOW</name>
							<description>TSE Compare Low Temperature Event Status Before Masking</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SRMSK</name>
					<description>SCU Service Request Mask</description>
					<addressOffset>0x0004</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRWARN</name>
							<description>WDT pre-warning Interrupt Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDPI</name>
							<description>VDDP pre-warning Interrupt Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VDROPI</name>
							<description>VDROP Interrupt Mask</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCI</name>
							<description>Loss of Clock Interrupt Mask</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PESRAMI</name>
							<description>16kbytes SRAM Parity Error Interrupt Mask</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PEU0I</name>
							<description>USIC0 SRAM Parity Error Interrupt Mask</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLECC2I</name>
							<description>Flash Double Bit ECC Interrupt Mask</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VCLIPI</name>
							<description>VCLIP Interrupt Mask</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SBYCLKFI</name>
							<description>Standby Clock Failure Interrupt Mask</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTC_CTR</name>
							<description>RTC CTR Mirror Register Update Mask</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTC_ATIM0</name>
							<description>RTC ATIM0 Mirror Register Update Mask</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTC_ATIM1</name>
							<description>RTC ATIM1 Mirror Register Update Mask</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTC_TIM0</name>
							<description>RTC TIM0 Mirror Register Update Mask</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTC_TIM1</name>
							<description>RTC TIM1 Mirror Register Update Mask</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSE_DONE</name>
							<description>TSE Measurement Done Interrupt Mask</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSE_HIGH</name>
							<description>TSE Compare High Temperature Interrupt Mask</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSE_LOW</name>
							<description>TSE Compare Low Temperature Interrupt Mask</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SRCLR</name>
					<description>SCU Service Request Clear</description>
					<addressOffset>0x0008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRWARN</name>
							<description>WDT pre-warning Interrupt Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PI</name>
							<description>RTC Periodic Interrupt Clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>AI</name>
							<description>RTC Alarm Interrupt Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>VDDPI</name>
							<description>VDDP pre-warning Interrupt Clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>VDROPI</name>
							<description>VDROP Interrupt Clear</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LOCI</name>
							<description>Loss of Clock Interrupt Clear</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PESRAMI</name>
							<description>16kbytes SRAM Parity Error Interrupt Clear</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PEU0I</name>
							<description>USIC0 SRAM Parity Error Interrupt Clear</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FLECC2I</name>
							<description>Flash Double Bit ECC Interrupt Clear</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FLCMPLTI</name>
							<description>Flash Operation Complete Interrupt Clear</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>VCLIPI</name>
							<description>VCLIP Interrupt Clear</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SBYCLKFI</name>
							<description>Standby Clock Failure Interrupt Clear</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_CTR</name>
							<description>RTC CTR Mirror Register Update Clear</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_ATIM0</name>
							<description>RTC ATIM0 Mirror Register Update Clear</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_ATIM1</name>
							<description>RTC ATIM1 Mirror Register Update Clear</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_TIM0</name>
							<description>RTC TIM0 Mirror Register Update Clear</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_TIM1</name>
							<description>RTC TIM1 Mirror Register Update Clear</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSE_DONE</name>
							<description>TSE Measurement Done Interrupt Clear</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSE_HIGH</name>
							<description>TSE Compare High Temperature Interrupt Clear</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSE_LOW</name>
							<description>TSE Compare Low Temperature Interrupt Clear</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SRSET</name>
					<description>SCU Service Request Set</description>
					<addressOffset>0x000C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRWARN</name>
							<description>WDT pre-warning Interrupt Set</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PI</name>
							<description>RTC Periodic Interrupt Set</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>AI</name>
							<description>RTC Alarm Interrupt Set</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>VDDPI</name>
							<description>VDDP pre-warning Interrupt Set</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>VDROPI</name>
							<description>VDROP Interrupt Set</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LOCI</name>
							<description>Loss of Clock Interrupt Set</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PESRAMI</name>
							<description>16kbytes SRAM Parity Error Interrupt Set</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PEU0I</name>
							<description>USIC0 SRAM Parity Error Interrupt Set</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FLECC2I</name>
							<description>Flash Double Bit ECC Interrupt Set</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FLCMPLTI</name>
							<description>Flash Operation Complete Interrupt Set</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>VCLIPI</name>
							<description>VCLIP Interrupt Set</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SBYCLKFI</name>
							<description>Standby Clock Failure Interrupt Set</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_CTR</name>
							<description>RTC CTR Mirror Register Update Set</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_ATIM0</name>
							<description>RTC ATIM0 Mirror Register Update Set</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_ATIM1</name>
							<description>RTC ATIM1 Mirror Register Update Set</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_TIM0</name>
							<description>RTC TIM0 Mirror Register Update Set</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_TIM1</name>
							<description>RTC TIM1 Mirror Register Update Set</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSE_DONE</name>
							<description>TSE Measurement Done Interrupt Set</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSE_HIGH</name>
							<description>TSE Compare High Temperature Interrupt Set</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSE_LOW</name>
							<description>TSE Compare Low Temperature Interrupt Set</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
