alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1100.svd
				<register>
					<name>C3V</name>
					<description>Capture Register 3</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>CAPTV</name>
							<description>Capture Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPCV</name>
							<description>Prescaler Value</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FFL</name>
							<description>Full Flag</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No new value was captured into the specific capture register</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A new value was captured into the specific register</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>INTS</name>
					<description>Interrupt Status</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PMUS</name>
							<description>Period Match while Counting Up</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Period match while counting up not detected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Period match while counting up detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OMDS</name>
							<description>One Match while Counting Down</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>One match while counting down not detected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>One match while counting down detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMUS</name>
							<description>Compare Match while Counting Up</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compare match while counting up not detected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Compare match while counting up detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMDS</name>
							<description>Compare Match while Counting Down</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compare match while counting down not detected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Compare match while counting down detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>E0AS</name>
							<description>Event 0 Detection Status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Event 0 not detected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Event 0 detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>E1AS</name>
							<description>Event 1 Detection Status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Event 1 not detected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Event 1 detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>E2AS</name>
							<description>Event 2 Detection Status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Event 2 not detected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Event 2 detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPF</name>
							<description>Trap Flag Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTE</name>
					<description>Interrupt Enable Control</description>
					<addressOffset>0xA4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PME</name>
							<description>Period match while counting up enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Period Match interrupt is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Period Match interrupt is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OME</name>
							<description>One match while counting down enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>One Match interrupt is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>One Match interrupt is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMUE</name>
							<description>Compare match while counting up enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compare Match while counting up interrupt is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Compare Match while counting up interrupt is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMDE</name>
							<description>Compare match while counting down enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compare Match while counting down interrupt is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Compare Match while counting down interrupt is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>E0AE</name>
							<description>Event 0 interrupt enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Event 0 detection interrupt is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Event 0 detection interrupt is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>E1AE</name>
							<description>Event 1 interrupt enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Event 1 detection interrupt is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Event 1 detection interrupt is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>E2AE</name>
							<description>Event 2 interrupt enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Event 2 detection interrupt is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Event 2 detection interrupt is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SRS</name>
					<description>Service Request Selector</description>
					<addressOffset>0xA8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>POSR</name>
							<description>Period/One match Service request selector</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Forward to CC4ySR0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Forward to CC4ySR1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Forward to CC4ySR2</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Forward to CC4ySR3</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMSR</name>
							<description>Compare match Service request selector</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Forward to CC4ySR0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Forward to CC4ySR1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Forward to CC4ySR2</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Forward to CC4ySR3</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>E0SR</name>
							<description>Event 0 Service request selector</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Forward to CC4ySR0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Forward to CC4ySR1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Forward to CC4ySR2</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Forward to CC4ySR3</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>E1SR</name>
							<description>Event 1 Service request selector</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Forward to CC4ySR0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Forward to CC4ySR1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Forward to CC4ySR2</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Forward to CC4ySR3</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>E2SR</name>
							<description>Event 2 Service request selector</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Forward to CC4ySR0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Forward to CC4ySR1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Forward to CC4ySR2</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Forward to CC4ySR3</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWS</name>
					<description>Interrupt Status Set</description>
					<addressOffset>0xAC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SPM</name>
							<description>Period match while counting up set</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SOM</name>
							<description>One match while counting down set</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCMU</name>
							<description>Compare match while counting up set</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SCMD</name>
							<description>Compare match while counting down set</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SE0A</name>
							<description>Event 0 detection set</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SE1A</name>
							<description>Event 1 detection set</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SE2A</name>
							<description>Event 2 detection set</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>STRPF</name>
							<description>Trap Flag status set</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWR</name>
					<description>Interrupt Status Clear</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RPM</name>
							<description>Period match while counting up clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ROM</name>
							<description>One match while counting down clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RCMU</name>
							<description>Compare match while counting up clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RCMD</name>
							<description>Compare match while counting down clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RE0A</name>
							<description>Event 0 detection clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RE1A</name>
							<description>Event 1 detection clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RE2A</name>
							<description>Event 2 detection clear</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTRPF</name>
							<description>Trap Flag status clear</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ECRD0</name>
					<description>Extended Read Back 0</description>
					<addressOffset>0xB8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>CAPV</name>
							<description>Timer Capture Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPCV</name>
							<description>Prescaler Capture value</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPTR</name>
							<description>Slice pointer</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CC40</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CC41</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CC42</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CC43</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VPTR</name>
							<description>Capture register pointer</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Capture register 0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Capture register 1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Capture register 2</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Capture register 3</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FFL</name>
							<description>Full Flag</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No new value was captured into this register</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A new value has been captured into this register</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LCV</name>
							<description>Lost Capture Value</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No capture was lost</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A capture was lost</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
